In [33]:
#Answer_1

import pandas as pd 
list =[4,8,15,16,23,42]
series=pd.Series(list)
type(series)

pandas.core.series.Series

In [20]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [34]:
#Answer_2

list_type_var=[1,2,3,4,5,6,7,8,9,10]
list_series=pd.Series(list_type_var)
type(list_series)

pandas.core.series.Series

In [26]:
print(list_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [36]:
#Answer_3

person_data_info={'name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
person_dataframe=pd.DataFrame(person_data_info)
type(person_dataframe)

pandas.core.frame.DataFrame

In [31]:
person_dataframe

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [39]:
#Answer_4

Dataframe can be define as the data which are reperesent in tabular form means rows and columns
or 2-D array data structure.

# difference between the two structures in a table:

             Pandas Series                                                 	     Pandas DataFrame
   * One-dimensional	                                               * Two-dimensional
   * Homogenous – Series elements must be of the same data type.	   * Heterogenous – DataFrame elements can have different data types.
    *Size-immutable – Once created, the size of a Series object        *Size-mutable – Elements can be dropped or added in an existing DataFrame.
    cannot be changed.

In [3]:
#example of pandas series and dataframes
import pandas as pd
student_data={'name':['abhi','sumit','sarthak','pooja','bharti devi'],
              'Age':[20,21,18,52,32],
              'class':['cse','mechanical','electrical','robotics','web dev']}
student_dataframe=pd.DataFrame(student_data)
type(student_dataframe)

pandas.core.frame.DataFrame

In [4]:
student_dataframe               #data which are in tabular form or a 2-D array and it contain all type of data .

          name  Age       class
0         abhi   20         cse
1        sumit   21  mechanical
2      sarthak   18  electrical
3        pooja   52    robotics
4  bharti devi   32     web dev

In [5]:
print(student_dataframe['name'])            #data which are in 1-D array and contain only single datatype element
type(student_dataframe['name'])

0           abhi
1          sumit
2        sarthak
3          pooja
4    bharti devi
Name: name, dtype: object

pandas.core.series.Series

In [6]:
#Answer_5

student_dataframe

#now we use comman function to manipulate data in dataframe
student_dataframe.head(3)        #if we need to only first three row of data

      name  Age       class
0     abhi   20         cse
1    sumit   21  mechanical
2  sarthak   18  electrical

In [7]:
student_dataframe.tail(2)          #we use this function to get last two rows of data

          name  Age     class
3        pooja   52  robotics
4  bharti devi   32   web dev

In [8]:
student_dataframe.columns           #this method is used get columns name of the dataframe

Index(['name', 'Age', 'class'], dtype='object')

In [9]:
student_dataframe['name'] #when we need only one column data

0           abhi
1          sumit
2        sarthak
3          pooja
4    bharti devi
Name: name, dtype: object

In [10]:
student_dataframe[['Age','name']]       #when we need multiple column data

   Age         name
0   20         abhi
1   21        sumit
2   18      sarthak
3   52        pooja
4   32  bharti devi

In [17]:
from pandas import DataFrame
subset_dataframe=DataFrame(student_dataframe,columns=['Age','name','class','salary'])
subset_dataframe.head(3)               #it give orders to the columns name as give by you

   Age     name       class  salary
0   20     abhi         cse     NaN
1   21    sumit  mechanical     NaN
2   18  sarthak  electrical     NaN

In [18]:
subset_dataframe.columns   #we added new column name at runtime

Index(['Age', 'name', 'class', 'salary'], dtype='object')

In [21]:
subset_dataframe.name      #we can access column data by using dot operator

0           abhi
1          sumit
2        sarthak
3          pooja
4    bharti devi
Name: name, dtype: object

In [24]:
del student_dataframe['class']      #if delete any column in dataframe

In [26]:
student_dataframe=subset_dataframe

In [27]:
student_dataframe

   Age         name  salary
0   20         abhi     NaN
1   21        sumit     NaN
2   18      sarthak     NaN
3   52        pooja     NaN
4   32  bharti devi     NaN

In [ ]:
#Answer_6

Dataframe and panel are the size mutable in nature but series not a mutable .

MutabilityAll Pandas data structures are value mutable (can be changed) and except Series.
Series is size immutable.
Note − DataFrame is widely used and one of the most important data structures.
Panel is used much less.

In [47]:
#Answer_7

name=['a','b','c','d','d']
clas=[1,2,3,4,5]
gender=['F','M','F','F','M']
index=[1,2,3,4,5]
s_name=pd.Series(name,index=index)
s_clas=pd.Series(clas,index=index)
s_gender=pd.Series(gender,index=index)

data_frame={'Name':s_name,'Class':s_clas,'Gender':s_gender}
df=pd.DataFrame(data_frame)
df['salary']=s_name
df

  Name  Class Gender salary
1    a      1      F      a
2    b      2      M      b
3    c      3      F      c
4    d      4      F      d
5    d      5      M      d